## Merging Joining and Concatenating

In [1]:
import pandas as pd
import numpy as np

### Concat

In [2]:
df1 = pd.read_csv("./DATA/reg-month1.csv")
df2 = pd.read_csv("./DATA/reg-month2.csv")

In [4]:
df1.head(2)

   student_id  course_id
0          23          1
1          15          5

In [5]:
df2.head(2)

   student_id  course_id
0           3          5
1          16          7

In [11]:
pd.concat([df1, df2]).iloc[0]

student_id    23
course_id      1
Name: 0, dtype: int64

### Multi Index Data

In [15]:
df_a = pd.DataFrame({
    "col1": [1,2,3,4,5],
    "col2": [0,3,4,1,2]
})

df_b = pd.DataFrame({
    "col1": [44,55,33,11,00],
    "col2": [11,22,33,44,55]
})

In [16]:
pd.concat([df_a, df_b], ignore_index=True)

   col1  col2
0     1     0
1     2     3
2     3     4
3     4     1
4     5     2
5    44    11
6    55    22
7    33    33
8    11    44
9     0    55

In [17]:
pd.concat([df_a, df_b], keys=["a", "b"])

     col1  col2
a 0     1     0
  1     2     3
  2     3     4
  3     4     1
  4     5     2
b 0    44    11
  1    55    22
  2    33    33
  3    11    44
  4     0    55

In [18]:
multi_df = pd.concat([df_a, df_b], keys=["a", "b"])

In [19]:
multi_df.loc["a"]

   col1  col2
0     1     0
1     2     3
2     3     4
3     4     1
4     5     2

In [20]:
multi_df.loc["a", 2]

col1    3
col2    4
Name: (a, 2), dtype: int64

In [22]:
multi_df.iloc[0]

col1    1
col2    0
Name: (a, 0), dtype: int64

In [24]:
pd.concat([df_a, df_b], axis=1)

   col1  col2  col1  col2
0     1     0    44    11
1     2     3    55    22
2     3     4    33    33
3     4     1    11    44
4     5     2     0    55

#### Inner Join: Common Join

In [30]:
df_1 = pd.DataFrame(
    {
        "s_id": [23, 14, 20, 10],
        "c_id": [1, 5, 2, 1]
    }
)

df_2 = pd.DataFrame(
    {
        "s_id": [23, 20, 1, 2],
        "name": ["John", "Jane", "Alice", "Bob"]
    }
)

In [31]:
df_1.merge(df_2, how="inner", on="s_id")

   s_id  c_id  name
0    23     1  John
1    20     2  Jane

##### Left Join: Intersection and all from left df

In [34]:
df_1.merge(df_2, how="left", on="s_id")

   s_id  c_id  name
0    23     1  John
1    14     5   NaN
2    20     2  Jane
3    10     1   NaN

##### Right Join: Intersection and all from right df

In [35]:
df_1.merge(df_2, how="right", on="s_id")

   s_id  c_id   name
0    23   1.0   John
1    20   2.0   Jane
2     1   NaN  Alice
3     2   NaN    Bob

#### Outer Join: Show all left common and right df

In [36]:
df_1.merge(df_2, how="outer", on="s_id")

   s_id  c_id   name
0     1   NaN  Alice
1     2   NaN    Bob
2    10   1.0    NaN
3    14   5.0    NaN
4    20   2.0   Jane
5    23   1.0   John